input: "data"
input_dim: 128
input_dim: 12800
input_dim: 1
input_dim: 1
input: "label"
input_dim: 128
input_dim: 1
input_dim: 1
input_dim: 1

#--------------------------layer 6------------------------
layers {
   name: "fc6"
   type: INNER_PRODUCT
   bottom: "data"
   top: "fc6"
   blobs_lr: 1.0
   blobs_lr: 2.0
   inner_product_param{
	   num_output: 4096
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 1
	   }
   }
}
layers {
   name: "relu6"
   type: RELU
   bottom: "fc6"
   top: "fc6"
}
layers {
    name: "drop6"
    type: DROPOUT
	bottom: "fc6"
    top: "fc6"
	dropout_param{
		dropout_ratio: 0.5
	}
}
#--------------------------layer 7------------------------
layers {
   name: "fc7"
   type: INNER_PRODUCT
   bottom: "fc6"
   top: "fc7"
   blobs_lr: 1.0
   blobs_lr: 2.0
   inner_product_param{
	   num_output: 4096
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 1
	   }
   }
}
layers {
   name: "relu7"
   type: RELU
   bottom: "fc7"
   top: "fc7"
}
layers {
    name: "drop7"
    type: DROPOUT
	bottom: "fc7"
    top: "fc7"
	dropout_param{
		dropout_ratio: 0.5
	}
}

#--------------------------layer 8------------------------
layers {
   name: "fc8_pascal"
   type: INNER_PRODUCT
   bottom: "fc7"
   top: "fc8_pascal"
   blobs_lr: 1.
   blobs_lr: 2.
   weight_decay: 1.
   weight_decay: 0.
   inner_product_param{
	   num_output: 21
	   weight_filler {
		 type: "gaussian"
		 std: 0.01
	   }
	   bias_filler {
		 type: "constant"
		 value: 1
	   }
   }
}
#-----------------------output------------------------
layers {
   name: "loss"
   type: SOFTMAX_LOSS
   bottom: "fc8_pascal"
   bottom: "label"
   top: "loss"
}

layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "fc8_pascal"
  bottom: "label"
  top: "accuracy"
  #include: { phase: TEST }
}
